package org.apache.lucene.analysis.bn;

import static org.apache.lucene.analysis.util.StemmerUtil.*;

public class BanglaStemmer {

	public int stem(char buffer[], int len) {

		String[][] suffix = new String[7][];
		suffix[0] = new String[] { "য়", "ও", "র", "ই", "ি" };
		suffix[1] = new String[] { "তি", "েই", "ের", "িত", "তা", "েও", "ীয়",
				"কে", "তে", "টি", "িক", "রা", "টা", "সহ", "রই" };
		suffix[2] = new String[] { "শীল", "তায়", "তাম", "বলী", "লেন", "টিও",
				"েরও", "টাও", "টিই", "ছেন", "ত্ব", "তার", "হীন", "রাও", "খোর",
				"তেও", "টাই", "কেই", "কেও", "টার", "ন্ত", "দের", "টির", "টায়",
				"য়ের", "য়েন" };
		suffix[3] = new String[] { "ভাবে", "টিতে", "টাতে", "টিকে", "ত্বই",
				"টারই", "দেরও", "টাকে", "চ্ছি", " েরই", "গুলো", "মূলক", "গুলা",
				"কারী", "ছিলে", "টুকু", "গুলি" };
		suffix[4] = new String[] { "গুলোর", "কারীই", "ত্বকে", "কারীও", "টুকুর",
				"গুলোই", " িদের", "টাতেই", "টুকুও", "ছিলাম", "কারীর", "টুকুই",
				"িতেছি", "ত্বের", "দেরকে", "গুলোয়", "টাকেই" };
		suffix[5] = new String[] { "কারীসহ", "কারীরা", "কারীকে", "দেরকেও",
				"দেরকেই", "চ্ছিলে", "গুলোতে", "টুকুরই", "গুলোকে", "গুলিতে",
				"টুকুতে" };
		suffix[6] = new String[] { "গুলোকেও", "টুকুতেও", "চ্ছিলাম", "ত্বমূলক",
				"কারীদের", "গুলোতেও", "কারীরাও" };

		for (int i = len > 7 ? 6 : len - 2; i >= 0; i--) {
			for (int j = 0; j < suffix[i].length; j++) {
				if (endsWith(buffer, len, suffix[i][j]) && len - i - 1 > 1) {
					return len - i - 1;
				}
			}
		}

		return len;
	}

}
